// ***********************
// * Page of an author with

// * Author's name
// * Years of life
// * Her/his picture
// * Biography in the form of timeline
// * List of artist's works with the date of creation
// * Photo gallery with author's picture and pictures of his/her works
// * Youtube video about the author / works / period of time author lived.
// *  Video must open in a new overlay (modal)
// * Place of author's major activity on a map: google / openstreetmap (leaflet) / yandex
// * It's okay if not every element (timeline, video, photo gallery, map)
// * will be present on every page

exports.authors = [
  {
    id: 0,
    name: "Yakub",
    surname: "Kolas",
    fullName: "Якуб Колас",
    photo: {
      link: "https://zn.deafsch.by/frontend/web/files/global/page/66.jpg",
      path: "*локальный путь на проекте - если будет надо*",
    },
    description:
      "Белорусский советский писатель, поэт и переводчик, общественный деятель. Один из классиков и основоположников новой белорусской литературы",
    birth: {
      date: "22 октября 1882 года",
      description:
        "Родился в деревне Акинчицы (теперь территория города Столбцы Столбцовского района Минской области Беларуси)",
      location: {
        name: "г.Столбцы",
        lat: 53.48214217471295,
        lng: 26.7375761625284,
        zoom: 6,
      },
    },
    death: {
      date: "13 августа 1956 года",
      description: "Похоронен на военном кладбище",
      location: {
        name: "г.Минск",
        lat: 53.89037067092244,
        lng: 27.560757392280152,
        zoom: 6,
      },
    },
    biography: [
      {
        date: "1902 год",
        description:
          "Окончил народную школу — Несвижскую учительскую семинарию",
      },
      {
        date: "1907 год",
        description:
          "Возглавлял литературный отдел белорусской газеты «Наша Нива» в Вильне",
      },
      {
        date: "1915 год",
        description:
          "Эвакуировался вместе с семьёй в Подмосковье, работал учителем в Дмитровском уезде. Мобилизован в армию",
      },
      {
        date: "1916 год",
        description:
          "Окончил Александровское военное училище и служил в запасном полку в Перми",
      },
      {
        date: "лето 1917 года",
        description: "В звании подпоручика был отправлен на Румынский фронт",
      },
      {
        date: "1918 год",
        description: "После демобилизации работал учителем в городе Обоянь",
      },
      {
        date: "С мая 1921 года",
        description:
          "Переехал в Минск. Занимался творческой и научной деятельностью",
      },
      {
        date: "1928 год",
        description: "Академик Академии наук БССР",
      },
      {
        date: "1929 год",
        description: "Вице-президент Академии наук БССР",
      },
      {
        date: "1941 - 1944 годы",
        description:
          "В годы ВОВ находился в эвакуации в Подмосковье, Ташкенте, Москве. В 1944 году вернулся в Минск",
      },
      {
        date: "1946 - 1956 годы",
        description: "Депутат ВС СССР",
      },
    ],
    works: [
      {
        date: "1906 год",
        description: "Первая публикация — стихотворение «Край родимый»",
      },
      {
        date: "1908 год",
        description: "Сборник стихов «Песни неволи»",
      },
      {
        date: "1910 год",
        description: "Сборник стихов «Песни печали»",
      },
      {
        date: "1923 год",
        description: "Поэма «Новая земля»",
      },
      {
        date: "1925 год",
        description: "Поэма «Сымон-музыкант»",
      },
      {
        date: "1926 год",
        description: "Повесть «На просторах жизни»",
      },
      {
        date: "1928 год",
        description: "Повесть «В глубине Полесья»",
      },
      {
        date: "1930 - 1935 годы",
        description:
          "Циклы стихов «Колхозное», «Осеннее», повесть «Отщепенец». События революции и гражданской войны отражены в повести «Трясина»",
      },
      {
        date: "1942 - 1945 годы",
        description:
          "Сборники стихотворений «Отомстим», «Голос земли»; поэмы «Суд в лесу» и «Возмездие»",
      },
      {
        date: "1954 год",
        description: "«На перепутье»",
      },
    ],
    gallery: [
      {
        link:
          "https://euroradio.fm/sites/default/files/styles/gallery_main/public/article/miniatures/2017/11/kolas.jpg?itok=_L0VOz4t&c=0d17294f2161d3f6381f6e86c4d32ce1",
        path: "локальный путь...",
      },
      {
        link:
          "https://www.belta.by/images/storage/news/with_archive/2017/000027_1509602250_big.jpg",
        path: "локальный путь...",
      },
      {
        link: "https://img.tyt.by/n/kultura/07/f/yakub_kolas_test_nov2.png",
        path: "локальный путь...",
      },
      {
        link: "https://www.nlb.by/upload/iblock/e9b/kolas.jpg",
        path: "локальный путь...",
      },
      {
        link:
          "https://www.sb.by/upload/iblock/67c/67c851bbe44e562985c0fc8183cf876d.jpg",
        path: "локальный путь...",
      },
    ],
    video: {
      youtubeId: '71kJB1j7Xwg',
      startTime: 34,
    },
  },
  {
    id: 1,
    name: 'Gregory',
    surname: 'Borodulin',
    fullName: 'Григорий Иванович Бородулин',
    photo:
    {
      link: 'https://www.belnovosti.by/sites/default/files/article/13-12-2016/233.jpg',
      path: '*локальный путь на проекте - если будет надо*',
    },
    description: 'Советский и белорусский поэт, эссеист, переводчик. Народный поэт Беларуси',
    birth:
    {
      date: '24 февраля 1935 года',
      description: 'Родился на хуторе Вересовка, официальное название хутора было «Городок-2». Теперь это северо-западная окраина дер.Тихоняты Сорочинского сельсовета',
      location:
      {
        name: 'дер.Тихоняты Сорочинского сельсовета',
        lat: 55.18132851883945,
        lng: 28.655963807829608,
        zoom: 6,
      },
    },
    death:
    {
      date: '2 марта 2014 года',
      description: 'Похоронен рядом с матерью на Ушачском кладбище, как и хотел поэт при жизни',
      location:
      {
        name: 'г.Ушачи, Витебская область',
        lat: 55.17926469992477,
        lng: 28.614041841542075,
        zoom: 6,
      },
    },
    biography:
      [
        {
          date: '1954 год',
          description: 'Окончил Ушачскую среднюю школу',
        },
        {
          date: '1959 год',
          description: 'Выпускник филологического факультета БГУ',
        },
        {
          date: 'После 1959 года',
          description: 'Работал редактором в издательствах «Беларусь» и «Художественная литература», а также в газете «Советская Белоруссия» и журналах «Берёзка» и «Пламя»',
        },
        {
          date: '1984 год',
          description: 'В составе государственной делегации Белорусской ССР принимал участие в 39 сессии Генеральной ассамблеи ООН',
        },
        {
          date: '1992 год',
          description: 'Стал последним белорусом, удостоившимся звания народного поэта',
        },
      ],
    works:
      [
        {
          date: '1953 год',
          description: 'Первые стихи в газете «Красная смена»',
        },
        {
          date: '1959 год',
          description: 'Сборник поэзии «Месяц над степью»',
        },
        {
          date: 'После 1959 года',
          description: 'Всего вышло около 70 сборников поэзии (в т.ч. сборники сатиры и юмора, а также стихи для детей)',
        },
        {
          date: '1984, 1996 - 2002 годы',
          description: 'Дважды издавались книги избранных стихов поэта',
        },
        {
          date: '1986 - 2006 годы',
          description: 'Стихотворные переводы на белорусский язык «Слова о полку Игореве», книг Федерико Гарсиа Лорки («Голубой звон Гренады»), «Рубаи» Омара Хайяма, произведений Шекспира, Байрона, Есенина и др.',
        },
        {
          date: '2006 год',
          description: 'Вышла книга избранных стихотворений Бородулина «Руны Перуновы»',
        },
      ],
    gallery:
      [
        {
          link: 'https://persons-info.com/userfiles/image/persons/0-10000/5000-6000/5243/BORODULIN_Rygor_Ivanovich7.jpg',
          path: 'локальный путь...',
        },
        {
          link: 'https://www.peoples.ru/art/literature/prose/national/ryhor_ryhor_borodulin/PymqONvZHNPC2.jpeg',
          path: 'локальный путь...',
        },
        {
          link: 'https://belaruspartisan.by/upload/iblock/cbf/cbf72f8cb3d0396c3450aba9ed315f32.jpg',
          path: 'локальный путь...',
        },
        {
          link: 'https://persons-info.com/userfiles/image/persons/0-10000/5000-6000/5243/BORODULIN_Rygor_Ivanovich10.jpg',
          path: 'локальный путь...',
        },
        {
          link: 'https://s12.stc.all.kpcdn.net/share/i/12/6500474/inx960x640.jpg',
          path: 'локальный путь...',
        },
      ],
    video: {
      youtubeId: 'WzJFsmUvTzI',
      startTime: 3,
    },
  },
  {
    id: 2,
    name: "Pimen",
    surname: "Panchenko",
    fullName: "Пимен Емельянович Панченко",
    photo: {
      link:
        "https://www.belta.by/images/storage/news/with_archive/2017/000027_972087_big.jpg",
      path: "*локальный путь на проекте - если будет надо*",
    },
    description:
      "Советский и белорусский поэт, эссеист, переводчик. Народный поэт Беларуси",
    birth: {
      date: "23 августа 1917 года",
      description:
        "Родился в Таллине (Эстония), куда родители, безземельные крестьяне, выехали в поисках заработка",
      location: {
        name: "г.Таллин, Эстония",
        lat: 59.43532480195083,
        lng: 24.748016649737906,
        zoom: 6,
      },
    },
    death: {
      date: "2 апреля 1995 года",
      description: "Похоронен в Минске на Восточном кладбище",
      location: {
        name: "г.Минск",
        lat: 53.89037067092244,
        lng: 27.560757392280152,
        zoom: 6,
      },
    },
    biography: [
      {
        date: "1933 год",
        description:
          "Семья переехала в Бобруйск. Пимен начал работать на деревообрабатывающем комбинате, а после поступил на учительские курсы",
      },
      {
        date: "1934 год",
        description:
          "Начал работать учителем в школах Бобруйского и Кировского районов",
      },
      {
        date: "1938 год",
        description: "Член Союза писателей СССР",
      },
      {
        date: "1939 год",
        description:
          "Окончил заочное отделение филологического факультета Минского учительского института",
      },
      {
        date: "С сентября 1939 года по январь 1946 года",
        description:
          "Служил специальным корреспондентом и писателем в армейских газетах. Призван Сталинским РВК г. Минска",
      },
      {
        date: "С 1946 года",
        description:
          "Начал работать в журнале «Вожык». Позже перешёл в газету «Литература и искусство»",
      },
      {
        date: "С 1946 года",
        description:
          "Начал работать в журнале «Вожык». Позже перешёл в газету «Литература и искусство»",
      },
      {
        date: "С 1946 года",
        description:
          "Редактор альманаха «Советская Отчизна». Возглавлял журнал «Молодость»",
      },
      {
        date: "1958 год",
        description:
          "В составе белорусской делегации принима лучастие на XII сессии Генассамблеи ООН",
      },
      {
        date: "С 1966 года",
        description:
          "Назначен секретарём правления СП БССР. Был депутатом ВС БССР 5, 6, 8 созывов",
      },
    ],
    works: [
      {
        date: "1934 год",
        description:
          "В кировской районной газете «Кировец» и альманахе «Ударники» (стихотворения «Ураджайнае» и «Моладзі»)",
      },
      {
        date: "1938 год",
        description: "Сборник стихов «Уверенность»",
      },
      {
        date: "1940 год",
        description: "Сборник стихов «Сентябрьские флаги»",
      },
      {
        date: "1944 год",
        description: "Сборник стихов «Иранский дневник»",
      },
      {
        date: "1943 - 1947 годы",
        description:
          "Стихи военных лет вошли в сборники «Дарога вайны», «Далёкія станцыі» и «Гарачыя вятры»",
      },
      {
        date: "1950 - 1962 годы",
        description:
          "В послевоенные годы на первый план выходят темы борьбы за мир и интернационализм, прославление социалистического строя, полётов в космос. Регулярно выходят сборники: «За шчасце, за мір», «Шырокі свет», «Кніга вандраванняў і любові», «Нью-Йоркскія малюнкі», «Тысяча небасхілаў»",
      },
      {
        date: "1966 - 1977 годы",
        description:
          "Важной вехой в творчестве стал выход поэтического сборника «Пры святле маланак», в котором доминируют философские мотивы. Сборники «Снежань», «Крык сойкі» и «Вячэрні цягнік» проникнуты размышлениями об актуальных проблемах человечества, любовью к родной земле",
      },
      {
        date: "после 1986 года",
        description:
          "Гражданскими мотивами проникнута поэзия Панченко времён перестройки и первых лет независимости Беларуси. В эти годы вышли сборники «І вера, і вернасць, і вечнасць», «Прылучэнне», «Горкі жолуд», «Неспакой» и «Высокі бераг». Широкий общественный резонанс вызвало произведение «Паэма сораму і гневу»",
      },
      {
        date: "1996 - 2002 годы",
        description:
          "Уже после смерти Панченко вышли сборники его поэзии разных лет: «Зямля ў мяне адна» и «Жытнёвы звон»",
      },
    ],
    gallery: [
      {
        link:
          "https://www.belta.by/uploads/lotus/news/000027_7ACA0C4281B2C51B4325818400232C95_132472.jpg",
        path: "локальный путь...",
      },
      {
        link:
          "https://www.sb.by/upload/medialibrary/7dc/7dcee2134ef2f493305e9f87b9f4008c.jpg",
        path: "локальный путь...",
      },
      {
        link:
          "https://www.sb.by/upload/medialibrary/c13/c13be6418cbc73ad2e317bf5f0642e67.jpg",
        path: "локальный путь...",
      },
      {
        link:
          "https://novychas.by/images/534c893b_607f_426b_9fe8_d41493ca5751_w1023_r1_s.jpg",
        path: "локальный путь...",
      },
      {
        link:
          "https://img-fotki.yandex.ru/get/1025946/311695.bee/0_c6ddd_c043d022_L.jpg",
        path: "локальный путь...",
      },
    ],
    video: {
      youtubeId: 'wpC11RbWnPE',
      startTime: 3,
    },
  },
  {
    id: 3,
    name: "Yanka",
    surname: "Kupala",
    fullName: "Янка Купала",
    photo: {
      link: "https://24smi.org/public/media/resize/800x-/celebrity/2018/12/06/ofy1rxpievtc-ianka-kupala.jpg",
      path: "*локальный путь на проекте - если будет надо*",
    },
    description:
      "Белорусский советский поэт и переводчик, драматург, публицист",
    birth: {
      date: "25 июня 1882 года",
      description:
        "Родился в деревне Вязынка (ныне Молодечненский район Минской области, Беларусь)",
      location: {
        name: "г.Молодечно",
        lat: 54.313611,
        lng: 26.851667,
        zoom: 6,
      },
    },
    death: {
      date: "28 июня 1942 года",
      description: "Похоронен в Минске на Военном кладбище, рядом с могилой матери",
      location: {
        name: "г.Минск",
        lat: 53.9081569,
        lng: 27.5845868,
        zoom: 6,
      },
    },
    biography: [
      {
        date: "1902 год",
        description:
          "Работал домашним учителем, писарем в помещичьем имении, приказчиком и на других работах",
      },
      {
        date: "1908-1909 годы",
        description:
          "Работал в редакции первой белорусской газеты «Наша Ніва»",
      },
      {
        date: "1909-1913 годы",
        description:
          "Учился в Санкт-Петербурге на подготовительных общеобразовательных курсах А. Черняева",
      },
      {
        date: "1915 год",
        description:
          "Учился в Московском городском народном университете имени А. Л. Шанявского",
      },
      {
        date: "1916 год",
        description:
          "Был призван в армию в дорожно-строительный отряд, в составе которого работал вплоть до наступления событий Октябрьской революции",
      },
      {
        date: "1925 год",
        description: "Народный поэт БССР",
      },
      {
        date: "1928 год",
        description: "Академик Академии наук БССР",
      },
      {
        date: "1929 год",
        description: "Академик Академии наук УССР",
      },
    ],
    works: [
      {
        date: "1907 год",
        description: "Поэмы «Зимой», «Никому», «Калека»",
      },
      {
        date: "1908 год",
        description: "Сборник стихов «Жалейка»",
      },
      {
        date: "1912 год",
        description: "Пьеса «Павлинка»",
      },
      {
        date: "1913 год",
        description: "Сборник стихов «Дорогой жизни»",
      },
      {
        date: "1922 год",
        description: "Сборник стихов «Наследие»",
      },
      {
        date: "1922 год",
        description: "Пьеса «Здешние»",
      },
      {
        date: "1925 год",
        description: "Сборник стихов «Безымянное»",
      },
      {
        date: "1930 год",
        description: "Сборник стихов «Отцветание»",
      },
      {
        date: "1936 год",
        description: "Сборник стихов «Песня строительству»",
      },
      {
        date: "1940 год",
        description: "Сборник стихов «От сердца»",
      },
      {
        date: "1942 год",
        description: "Сборник стихов «Белорусским партизанам»",
      },
    ],
    gallery: [
      {
        link:
          "https://a.d-cd.net/ef43feas-960.jpg",
        path: "локальный путь...",
      },
      {
        link:
          "https://24smi.org/public/media/resize/800x-/celebrity/2018/12/06/a4s1rh4cka2g-ianka-kupala-v-molodosti.jpg",
        path: "локальный путь...",
      },
      {
        link: "https://s9.stc.all.kpcdn.net/share/i/12/9933654/inx960x640.jpg",
        path: "локальный путь...",
      },
      {
        link: "https://www.stihi.ru/pics/2017/04/08/2792.jpg",
        path: "локальный путь...",
      },
      {
        link:
          "https://naviny.by/sites/default/files/field/image/kupala-600.jpg",
        path: "локальный путь...",
      },
    ],
    video: {
      youtubeId: 'aJbr-p5cYuI',
      startTime: 21,
    },
  },
  {
    id: 4,
    name: "Petrus",
    surname: "Brovka",
    fullName: "Пётр Устинович Бровка",
    photo: {
      link: "https://www.sb.by/upload/medialibrary/07e/07e2b058e731e2c0dd0181cfd61ddff7.jpg",
      path: "*локальный путь на проекте - если будет надо*",
    },
    description:
      "Белорусский советский писатель, поэт и переводчик, драматург, публицист",
    birth: {
      date: "12 июня 1905 года",
      description:
        "Родился в деревне Путилковичи (ныне Ушачский район, Витебская область, Беларусь)",
      location: {
        name: "д.Путилковичи",
        lat: 54.93778,
        lng: 28.38389,
        zoom: 6,
      },
    },
    death: {
      date: "24 марта 1980 года",
      description: "Похоронен в Минске на Восточном кладбище",
      location: {
        name: "г.Минск",
        lat: 53.89037067092244,
        lng: 27.560757392280152,
        zoom: 6,
      },
    },
    biography: [
      {
        date: "1918—1924 годы",
        description:
          "Работал переписчиком, делопроизводителем и счетоводом.",
      },
      {
        date: "1925—1927 годы",
        description:
          "Был завотделом Окружкома комсомола в Полоцке",
      },
      {
        date: "1927—1928 годы",
        description:
          "Был ответственным секретарём редакции газеты «Чырвоная Полаччына»",
      },
      {
        date: "1928—1931 годы",
        description:
          "Учился на педагогическом факультете БГУ",
      },
      {
        date: "1928 год",
        description:
          "Работал в литературном объединении «Маладняк», позже в Белорусской ассоциации пролетарских писателей (БелАПП)",
      },
      {
        date: "1941—1942 годы",
        description: "Служил в РККА, работал во фронтовой и партизанской печати",
      },
      {
        date: "1943—1945 годы",
        description: "Ответственный секретарь союза писателей БССР",
      },
      {
        date: "1945—1948 годы",
        description: "Главный редактор литературного журнала «Полымя»",
      },
      {
        date: "1948—1967 годы",
        description: "Председатель Правления союза писателей БССР",
      },
      {
        date: "1967—1980 годы",
        description: "Главный редактор Белорусской советской энциклопедии",
      },
    ],
    works: [
      {
        date: "1930 год",
        description: "Сборник стихов «Годы как шторм»",
      },
      {
        date: "1931 год",
        description: "Повесть «Каландры»",
      },
      {
        date: "1932 год",
        description: "Сборник стихов «Поэзия»",
      },
      {
        date: "1934 год",
        description: "Сборник стихов «Так начиналась молодость»",
      },
      {
        date: "1935 год",
        description: "Сборник стихов «Приход героя»",
      },
      {
        date: "1937 год",
        description: "Сборник стихов «Весна родины»",
      },
      {
        date: "1940 год",
        description: "Сборник стихов «Стихотворения и поэмы»",
      },
      {
        date: "1946 год",
        description: "Сборник стихов «В родном доме»",
      },
      {
        date: "1950 год",
        description: "Сборник стихов «Солнечными днями»",
      },
      {
        date: "1954 год",
        description: "Сборник стихов «Твёрдыми шагами»",
      },
      {
        date: "1957 год",
        description: "Роман «Когда сливаются реки»",
      },
      {
        date: "1960 год",
        description: "Сборник стихов «Далеко от дома»",
      },
      {
        date: "1967 год",
        description: "Поэма «Всегда с Лениным»",
      },
      {
        date: "1972 год",
        description: "Сборник стихов «Пожалуйста»",
      },
      {
        date: "1974 год",
        description: "Сборник рассказов «Вместе с комиссаром»",
      },
      {
        date: "1982 год",
        description: "Сборник стихов «Советский человек»",
      },
    ],
    gallery: [
      {
        link:
          "https://www.nlb.by/upload/prod/UNESCO/spisok/unesco-10-nlb-dates-Brouka.jpg",
        path: "локальный путь...",
      },
      {
        link:
          "https://minsk950.belta.by/images/tild3539-3432-4465-b662-643333386235__noroot.jpg",
        path: "локальный путь...",
      },
      {
        link: "https://www.sb.by/upload/iblock/062/06205d4575f30d422bec59a54d993de5.jpg",
        path: "локальный путь...",
      },
      {
        link: "https://places.by/wp-content/uploads/2017/08/Pyatrus-Brouka-600x428.jpg",
        path: "локальный путь...",
      },
      {
        link:
          "https://places.by/wp-content/uploads/2017/08/Mogila-Petrusya-Brovki.jpg",
        path: "локальный путь...",
      },
    ],
    video: {
      youtubeId: '7xHGTr4EbK4',
      startTime: 28,
    },
  },
  {
    id: 5,
    name: "Arkadi",
    surname: "Kuleshov",
    fullName: "Аркадий Александрович Кулешов",
    photo: {
      link: "https://loviknigu.ru/data/image_author/05/78/99.jpg",
      path: "*локальный путь на проекте - если будет надо*",
    },
    description:
      "Белорусский советский поэт и переводчик, сценарист",
    birth: {
      date: "24 января 1914 года",
      description:
        "Родился в деревне Самотевичи (ныне Костюковичский район Могилёвской области, Беларусь)",
      location: {
        name: "д.Самотевичи",
        lat: 53.210446,
        lng: 31.830949,
        zoom: 6,
      },
    },
    death: {
      date: "4 февраля 1978 года",
      description: "Похоронен в Минске на Восточном кладбище",
      location: {
        name: "г.Минск",
        lat: 53.89037067092244,
        lng: 27.560757392280152,
        zoom: 6,
      },
    },
    biography: [
      {
        date: "1918—1924 годы",
        description:
          "Работал переписчиком, делопроизводителем и счетоводом.",
      },
      {
        date: "1928 год",
        description:
          "После окончания Самотевичской семилетней школы поступил в Мстиславский педагогический техникум",
      },
      {
        date: "1930—1933 годы",
        description:
          "Переехал в Минск, где продолжал учёбу на литературном факультете Минского педагогического института",
      },
      {
        date: "1941-1942 годы",
        description:
          "Вступил в ряды РККА. Под Новгородом окончил военно-политическое училище и был направлен в армейскую газету «Знамя советов»",
      },
      {
        date: "1943-1944 годы",
        description:
          "Служил в Белорусском штабе партизанского движения",
      },
      {
        date: "1945—1946 годы",
        description: "Работал главным редактором газеты «Літаратура і мастацтва»",
      },
      {
        date: "1946—1958 годы",
        description: "Начальник сценарного отдела",
      },
      {
        date: "1958—1967 годы",
        description: "Главный редактор киностудии «Беларусьфильм»",
      },
    ],
    works: [
      {
        date: "1931 год",
        description: "Поэма «Обида»",
      },
      {
        date: "1933 год",
        description: "Поэма «Аммонал»",
      },
      {
        date: "1935 год",
        description: "Поэма «Горбун»",
      },
      {
        date: "1938 год",
        description: "Сборник стихов «Мы живём на границе»",
      },
      {
        date: "1940 год",
        description: "Сборник стихов «В зелёной дубраве»",
      },
      {
        date: "1941 год",
        description: "Поэма «Баранов Василий»",
      },
      {
        date: "1943 год",
        description: "Сборник стихов «Знамя бригады»",
      },
      {
        date: "1944 год",
        description: "Поэма «Дом № 24»",
      },
      {
        date: "1945 год",
        description: "Поэма «Приключения цимбал»",
      },
      {
        date: "1946 год",
        description: "Сборник стихов «Стихотворения»",
      },
      {
        date: "1949 год",
        description: "Поэма «Простые люди»",
      },
      {
        date: "1949 год",
        description: "Сборник стихов «Коммунисты»",
      },
      {
        date: "1954 год",
        description: "Сборник стихов «Границы»",
      },
      {
        date: "1972 год",
        description: "Поэма «Далеко до океана»",
      },
      {
        date: "1975 год",
        description: "Поэма «Хамутиус»",
      },
      {
        date: "1976 год",
        description: "Сборник стихов «Скорость»",
      },
    ],
    gallery: [
      {
        link:
          "https://forum.vgd.ru/file.php?fid=403275&key=2069824477",
        path: "локальный путь...",
      },
      {
        link:
          "https://upload.wikimedia.org/wikipedia/commons/f/f8/Stamps_of_Belarus_2014_Arkad%C5%BA_Kulia%C5%A1o%C7%94.jpg",
        path: "локальный путь...",
      },
      {
        link: "https://minsknews.by/wp-content/uploads/2019/07/1-44.jpg",
        path: "локальный путь...",
      },
      {
        link: "https://www.places.by/wp-content/uploads/2017/08/kuliaszou135.jpg",
        path: "локальный путь...",
      },
      {
        link:
          "https://zviazda.by/sites/default/files/field/image/21-17_kopiya_6.jpg",
        path: "локальный путь...",
      },
    ],
    video: {
      youtubeId: '-htllJNjITg',
      startTime: 1,
    },
  },
  {
    id: 6,
    name: "Maksim",
    surname: "Tank",
    fullName: "Максим Танк",
    photo: {
      link: "https://gazetaby.com/uploads/2017/09/tank_18-1.jpg",
      path: "*локальный путь на проекте - если будет надо*",
    },
    description:
      "Белорусский советский поэт, переводчик, государственный деятель",
    birth: {
      date: "4 сентября 1912 года",
      description:
        "Родился в селе Пильковщина (ныне Мядельский район Минской области, Беларусь)",
      location: {
        name: "г.Мядель",
        lat: 54.875560,
        lng: 26.938610,
        zoom: 6,
      },
    },
    death: {
      date: "4 февраля 1978 года",
      description: "Похоронен в родном селе",
      location: {
        name: "д.Новики",
        lat: 54.787294,
        lng: 27.096704,
        zoom: 6,
      },
    },
    biography: [
      {
        date: "1914 год",
        description:
          "Семья поэта из-за первой мировой войны вынуждена эмигрировать в Москву",
      },
      {
        date: "1922 год",
        description:
          "Из-за сильного голода вместе с семьей покидает Москву и возвращается в родную деревню, чтобы самим выращивать свой хлеб",
      },
      {
        date: "1923-1926 годы",
        description:
          "Поступил в начальную польскую школу, а затем в русскую частную гимназию",
      },
      {
        date: "1928 год",
        description:
          "Перевелся в белорусскую гимназию в Радашковичах",
      },
      {
        date: "1929 год",
        description:
          "И за участие в забастовке, организованной гимназистами, был отчислен. После этого недолго учился в Виленской белорусской гимназии, но тоже был отчислен за вольнодумство и непослушание",
      },
      {
        date: "7 апреля 1932 года",
        description:
          "Публикует в газете “Беларускае жыццё” свое стихотворение “Заштрайкавалі гіганты-коміны” под псевдонимом Максим Танк",
      },
      {
        date: "27 апреля 1932 года",
        description: "За подпольную коммунистическую деятельность Танка арестовывают и садят в виленскую тюрьму Лукишки. Через месяц он выходит на свободу",
      },
      {
        date: "Осенью 1932 года",
        description: "Переходит советско-польскую границу и направляется в Минск. Здесь его арестовывают и две недели держат под стражей. Ведут допросы, проводят “дружеские беседы”. После этого молодого поэта депортируют назад",
      },
      {
        date: "1945-1948 годы",
        description: "Редактор сатирического журнала «Вожык»",
      },
      {
        date: "1948-1966 годы",
        description: "Главный редактор литературного журнала «Полымя»",
      },
      {
        date: "1966-1971 годы",
        description: "Первый секретарь правления в Союзе писателей БССР",
      },
      {
        date: "1971-1990 годы",
        description: "Председатель правления в Союзе писателей БССР",
      },
    ],
    works: [
      {
        date: "1936 год",
        description: "Сборник стихов «На этапах»",
      },
      {
        date: "1938 год",
        description: "Сборник стихов «Под мачтой»",
      },
      {
        date: "1945 год",
        description: "Сборник стихов «Точите оружие»",
      },
      {
        date: "1948 год",
        description: "Сборник стихов «Чтоб знали»",
      },
      {
        date: "1954 год",
        description: "Сборник стихов «В дороге»",
      },
      {
        date: "1955 год",
        description: "Сказка «Конь и лев»",
      },
      {
        date: "1957 год",
        description: "Сборник стихов «След молнии»",
      },
      {
        date: "1963 год",
        description: "Сборник стихов «Лирика»",
      },
      {
        date: "1970 год",
        description: "Сказка «Светлячок»",
      },
      {
        date: "1972 год",
        description: "Сборник стихов «Журавлиный клин»",
      },
      {
        date: "1984 год",
        description: "Сборник стихов «За моим столом»",
      },
      {
        date: "1988 год",
        description: "Сборник стихов «Дорога и хлеб»",
      },
      {
        date: "1990 год",
        description: "Сборник стихов «Послушайте, весна идёт»",
      },
      {
        date: "1994 год",
        description: "Сборник стихов «Мой ковчег»",
      },
      {
        date: "1937 год",
        description: "Сборник стихов «Нарач»",
      },
    ],
    gallery: [
      {
        link:
          "https://gazetaby.com/uploads/2017/09/tank_18-2.jpg",
        path: "локальный путь...",
      },
      {
        link:
          "https://gazetaby.com/uploads/2017/09/tank_18-7.jpg",
        path: "локальный путь...",
      },
      {
        link: "https://www.sb.by/upload/medialibrary/42d/42d5281c105c7d8664131043599ee11f.jpg",
        path: "локальный путь...",
      },
      {
        link: "https://zviazda.by/sites/default/files/field/image/7_38.jpg",
        path: "локальный путь...",
      },
      {
        link:
          "https://www.belta.by/uploads/lotus/news/000027_25D7C6C9F9FEB3234325819C0026C82D_521788.jpg",
        path: "локальный путь...",
      },
    ],
    video: {
      youtubeId: '40Uhtifsk7s',
      startTime: 21,
    },
  },
]
