// ***********************
// * Page of an author with

// * Author's name
// * Years of life
// * Her/his picture
// * Biography in the form of timeline
// * List of artist's works with the date of creation
// * Photo gallery with author's picture and pictures of his/her works
// * Youtube video about the author / works / period of time author lived.
// *  Video must open in a new overlay (modal)
// * Place of author's major activity on a map: google / openstreetmap (leaflet) / yandex
// * It's okay if not every element (timeline, video, photo gallery, map)
// * will be present on every page

exports.authors = [
  {
    id: 0,
    name: 'Yakub',
    surname: 'Kolas',
    fullName: 'Якуб Колас',
    photo: {
      link: 'https://zn.deafsch.by/frontend/web/files/global/page/66.jpg',
      path: '*локальный путь на проекте - если будет надо*',
    },
    description:
      'Беларускі паэт, празаік, драматург, крытык, публіцыст, перакладчык, вучоны, педагог, грамадскі дзеяч; адзін з заснавальнікаў (з Янкам Купалам) сучаснай беларускай літаратуры і літаратурнай мовы.',
    birth: {
      date: '22 кастрычніка 1882 года',
      description:
        'Нарадзіўся ў вёсцы Акінчыцы (цяпер тэрыторыя горада Стоўбцы Стаўбцоўскага раёна Мінскай вобласці Беларусі)',
      location: {
        name: 'г.Стоўбцы',
        lat: 53.48214217471295,
        lng: 26.7375761625284,
        zoom: 7,
      },
    },
    death: {
      date: '13 жніўня 1956 года',
      description: 'Пахаваны на Вайсковых могілках',
      location: {
        name: 'г.Мінск',
        lat: 53.89037067092244,
        lng: 27.560757392280152,
        zoom: 7,
      },
    },
    biography: [
      {
        date: '1902 год',
        description:
          'Скончыў народную школу - Нясвіжскую настаўніцкую семінарыю',
      },
      {
        date: '1907 год',
        description:
          'Узначальваў літаратурны аддзел беларускай газеты «Наша Ніва» ў Вільні',
      },
      {
        date: '1915 год',
        description:
          "Эвакуіраваўся разам з сям'ёй у Падмаскоўі, працаваў настаўнікам у Дзмітраўскім павеце. Мабілізаваны ў армію",
      },
      {
        date: '1916 год',
        description:
          'Скончыў Аляксандраўскае ваеннае вучылішча і служыў у запасным палку ў Пермі',
      },
      {
        date: 'лета 1917 года',
        description: 'У званні падпаручніка быў адпраўлены на Румынскі фронт',
      },
      {
        date: '1918 год',
        description:
          'Пасля дэмабілізацыі працаваў настаўнікам у горадзе Абаянь',
      },
      {
        date: 'Травень 1921 года',
        description: 'Пераехаў у Мінск. Займаўся творчай і навуковай дзейнасцю',
      },
      {
        date: '1928 год',
        description: 'Акадэмік Акадэміі навук БССР',
      },
      {
        date: '1929 год',
        description: 'Віцэ-прэзідэнт Акадэміі навук БССР',
      },
      {
        date: '1941 - 1944 гады',
        description:
          'У гады Вялікай Айчыннай вайны знаходзіўся ў эвакуацыі ў Падмаскоўі, Ташкенце, Маскве. У 1944 годзе вярнуўся ў Мінск',
      },
      {
        date: '1946 - 1956 гады',
        description: 'Дэпутат ВС СССР',
      },
    ],
    works: [
      {
        date: '1906 год',
        description: 'Першая публікацыя - верш «Край родны»',
      },
      {
        date: '1908 год',
        description: 'Зборнік вершаў «Песні няволі»',
      },
      {
        date: '1910 год',
        description: 'Зборнік вершаў «Песні смутку»',
      },
      {
        date: '1923 год',
        description: 'Паэма «Новая зямля»',
      },
      {
        date: '1925 год',
        description: 'Паэма «Сымон-музыка»',
      },
      {
        date: '1926 год',
        description: 'Аповесць «На прасторах жыцця»',
      },
      {
        date: '1928 год',
        description: 'Аповесць «У глыбіні Палесся»',
      },
      {
        date: '1930 - 1935 гады',
        description:
          'Цыклы вершаў «калгаснай», «Восеньскае», аповесць «адшчапенец». Падзеі рэвалюцыі і грамадзянскай вайны адлюстраваны ў аповесці «Дрыгва»',
      },
      {
        date: '1942 - 1945 гады',
        description:
          'Зборнікі вершаў «Адпомсцім», «Голас зямлі»; паэмы «Суд у лесе» і «Адплата»',
      },
      {
        date: '1954 год',
        description: '«На ростанях»',
      },
    ],
    gallery: [
      {
        link:
          'https://euroradio.fm/sites/default/files/styles/gallery_main/public/article/miniatures/2017/11/kolas.jpg?itok=_L0VOz4t&c=0d17294f2161d3f6381f6e86c4d32ce1',
        path: 'локальный путь...',
      },
      {
        link:
          'https://www.belta.by/images/storage/news/with_archive/2017/000027_1509602250_big.jpg',
        path: 'локальный путь...',
      },
      {
        link: 'https://img.tyt.by/n/kultura/07/f/yakub_kolas_test_nov2.png',
        path: 'локальный путь...',
      },
      {
        link: 'https://www.nlb.by/upload/iblock/e9b/kolas.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://www.sb.by/upload/iblock/67c/67c851bbe44e562985c0fc8183cf876d.jpg',
        path: 'локальный путь...',
      },
    ],
    video: {
      youtubeId: '71kJB1j7Xwg',
      startTime: 34,
    },
  },
  {
    id: 1,
    name: 'Gregory',
    surname: 'Borodulin',
    fullName: 'Рыгор Іванавіч Барадулін',
    photo: {
      link:
        'https://www.belnovosti.by/sites/default/files/article/13-12-2016/233.jpg',
      path: '*локальный путь на проекте - если будет надо*',
    },
    description: 'Беларускі і савецкі паэт, эсэіст і перакладчык',
    birth: {
      date: '24 лютага 1935 года',
      description:
        'Нарадзіўся на хутары Вересовка, афіцыйная назва хутара было «Гарадок-2». Зараз гэта паўночна-заходняя ўскраіна вёска Тіхоняты Сарочынскаго сельсавета',
      location: {
        name: 'в.Тіхоняты Сарочынскаго сельсавета',
        lat: 55.18132851883945,
        lng: 28.655963807829608,
        zoom: 9,
      },
    },
    death: {
      date: '2 сакавіка 2014 года',
      description:
        'Пахаваны побач з маці на Ўшацкім могілках, як і хацеў паэт пры жыцці',
      location: {
        name: 'г.Ушачі, Віцебская вобласць',
        lat: 55.17926469992477,
        lng: 28.614041841542075,
        zoom: 9,
      },
    },
    biography: [
      {
        date: '1954 год',
        description: 'Скончыў Ушацкую сярэднюю школу',
      },
      {
        date: '1959 год',
        description: 'Выпускнік філалагічнага факультэта БДУ',
      },
      {
        date: 'Пасля 1959 года',
        description:
          'Працаваў рэдактарам у выдавецтвах «Беларусь» і «Мастацкая літаратура», а таксама ў газеце «Савецкая Беларусь» і часопісах «Бярозка» і «Полымя»',
      },
      {
        date: '1984 год',
        description:
          'У складзе дзяржаўнай дэлегацыі Беларускай ССР прымаў удзел у 39 сесіі Генеральнай асамблеі ААН',
      },
      {
        date: '1992 год',
        description:
          'Стаў апошнім беларусам, якому надалі звання народнага паэта',
      },
    ],
    works: [
      {
        date: '1953 год',
        description: 'Першыя вершы ў газеце «Чырвоная змена»',
      },
      {
        date: '1959 год',
        description: 'Зборнік паэзіі «Месяц над стэпам»',
      },
      {
        date: 'Пасля 1959 года',
        description:
          'Усяго выйшла каля 70 зборнікаў паэзіі (у тым ліку зборнікі сатыры і гумару, а таксама вершы для дзяцей)',
      },
      {
        date: '1984, 1996 - 2002 гады',
        description: 'Двойчы выдаваліся кнігі выбраных вершаў паэта',
      },
      {
        date: '1986 - 2006 гады',
        description:
          'Вершаваныя пераклады на беларускую мову «Слова пра паход Ігараў», кніг Федэрыка Гарсія Лоркі («Блакітны звон Грэнады»), «Руба» Амара Хайяма, твораў Шэкспіра, Байрана, Ясеніна і інш.',
      },
      {
        date: '2006 год',
        description: 'Выйшла кніга выбраных вершаў Барадуліна «Руны Перуновы»',
      },
    ],
    gallery: [
      {
        link:
          'https://persons-info.com/userfiles/image/persons/0-10000/5000-6000/5243/BORODULIN_Rygor_Ivanovich7.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://www.peoples.ru/art/literature/prose/national/ryhor_ryhor_borodulin/PymqONvZHNPC2.jpeg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://belaruspartisan.by/upload/iblock/cbf/cbf72f8cb3d0396c3450aba9ed315f32.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://persons-info.com/userfiles/image/persons/0-10000/5000-6000/5243/BORODULIN_Rygor_Ivanovich10.jpg',
        path: 'локальный путь...',
      },
      {
        link: 'https://s12.stc.all.kpcdn.net/share/i/12/6500474/inx960x640.jpg',
        path: 'локальный путь...',
      },
    ],
    video: {
      youtubeId: 'WzJFsmUvTzI',
      startTime: 3,
    },
  },
  {
    id: 2,
    name: 'Pimen',
    surname: 'Panchenko',
    fullName: 'Пімен Емяльянавіч Панчанка',
    photo: {
      link:
        'https://www.belta.by/images/storage/news/with_archive/2017/000027_972087_big.jpg',
      path: '*локальный путь на проекте - если будет надо*',
    },
    description:
      'Беларускі і савецкі паэт, эсэіст і перакладчык. Народны паэт Беларусі',
    birth: {
      date: '23 жніўня 1917 года',
      description:
        'Нарадзіўся ў Таліне (Эстонія), куды бацькі, беззямельныя сяляне, выехалі ў пошуках заробку',
      location: {
        name: 'г.Талін, Эстонія',
        lat: 59.43532480195083,
        lng: 24.748016649737906,
        zoom: 3,
      },
    },
    death: {
      date: '2 красавіка 1995 года',
      description: 'Пахаваны ў Мінску на Усходніх могілках',
      location: {
        name: 'г.Мінск',
        lat: 53.89037067092244,
        lng: 27.560757392280152,
        zoom: 3,
      },
    },
    biography: [
      {
        date: '1933 год',
        description:
          "Сям'я пераехала ў Бабруйск. Пімен пачаў працаваць на дрэваапрацоўчым камбінаце, а пасля паступіў на настаўніцкія курсы",
      },
      {
        date: '1934 год',
        description:
          'Пачаў працаваць настаўнікам у школах Бабруйскага і Кіраўскага раёнаў',
      },
      {
        date: '1938 год',
        description: 'Член Саюза пісьменнікаў СССР',
      },
      {
        date: '1939 год',
        description:
          'Скончыў завочнае аддзяленне філалагічнага факультэта Мінскага настаўніцкага інстытута',
      },
      {
        date: 'З верасня 1939 года па студзень 1946 года',
        description:
          'Служыў спецыяльным карэспандэнтам і пісьменнікам у армейскіх газетах. Закліканы Сталінскім РВК г.Мінска',
      },
      {
        date: 'З 1946 года',
        description:
          'Пачаў працаваць у часопісе «Вожык». Пазней перайшоў у газету «Літаратура і мастацтва»',
      },
      {
        date: 'З 1946 года',
        description:
          'Рэдактар альманаха «Советская Айчына». Узначальваў часопіс «Маладосць»',
      },
      {
        date: '1958 год',
        description:
          'У складзе беларускай дэлегацыі прымаў удзел на XII сесіі Генасамблеі ААН',
      },
      {
        date: 'З 1966 года',
        description:
          'Прызначаны сакратаром праўлення СП БССР. Быў дэпутатам ВС БССР 5, 6, 8 скліканняў',
      },
    ],
    works: [
      {
        date: '1934 год',
        description:
          'У Кіраўскім раёне газеце «Кіравец» і альманаху «Ударнік» (вершы «Ураджайнае» і «Моладзі»)',
      },
      {
        date: '1938 год',
        description: 'Зборнік вершаў «Упэўненасць»',
      },
      {
        date: '1940 год',
        description: 'Зборнік вершаў «Вераснёвыя сцягі»',
      },
      {
        date: '1944 год',
        description: 'Зборнік вершаў «Іранскі дзённік»',
      },
      {
        date: '1943 - 1947 гады',
        description:
          'Вершы ваенных гадоў ўвайшлі ў зборнікі «Дарога вайны», «Далёкія станцыі» і «Гарачыя вятры»',
      },
      {
        date: '1950 - 1962 гады',
        description:
          'У пасляваенныя гады на першы план выходзяць тэмы барацьбы за мір і інтэрнацыяналізм, ўслаўленне сацыялістычнага ладу, палётаў у космас. Рэгулярна выходзяць зборнікі: «За шчасце, за мір», «Шырокі свет», «Кніга вандраванняў І любові», «Нью-Йоркскія малюнкі», «Тысяча небасхілаў»',
      },
      {
        date: '1966 - 1977 гады',
        description:
          'Важнай вяхой у творчасці стаў выхад паэтычнага зборніка «Пры Святло маланак», у якім дамінуюць філасофскія матывы. Зборнікі «Cнежань», «Крык сойкі» і «Вячэрні цягнік» прасякнуты разважаннямі пра актуальныя праблемы чалавецтва, любоўю да роднай зямлі',
      },
      {
        date: 'Пасля 1986 года',
        description:
          'Грамадзянскімі матывамі прасякнута паэзія Панчанка часоў перабудовы і першых гадоў незалежнасьці Беларусі. У гэтыя гады выйшлі зборнікі «І вера, і Вернасць, і вечнасць», «Прылучэнне», «Горкі жолуд», «Неспакой» і «Высокі берагах». Шырокі грамадскі рэзананс выклікала твор «паэма сораму і гневу»',
      },
      {
        date: '1996 - 2002 гады',
        description:
          'Ужо пасля смерці Панчанка выйшлі зборнікі яго паэзіі розных гадоў: «Зямля ў мяне Адна» і «Жытнёвы звон»',
      },
    ],
    gallery: [
      {
        link:
          'https://www.belta.by/uploads/lotus/news/000027_7ACA0C4281B2C51B4325818400232C95_132472.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://www.sb.by/upload/medialibrary/7dc/7dcee2134ef2f493305e9f87b9f4008c.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://www.sb.by/upload/medialibrary/c13/c13be6418cbc73ad2e317bf5f0642e67.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://novychas.by/images/534c893b_607f_426b_9fe8_d41493ca5751_w1023_r1_s.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://img-fotki.yandex.ru/get/1025946/311695.bee/0_c6ddd_c043d022_L.jpg',
        path: 'локальный путь...',
      },
    ],
    video: {
      youtubeId: 'wpC11RbWnPE',
      startTime: 3,
    },
  },
  {
    id: 3,
    name: 'Yanka',
    surname: 'Kupala',
    fullName: 'Янка Купала',
    photo: {
      link:
        'https://24smi.org/public/media/resize/800x-/celebrity/2018/12/06/ofy1rxpievtc-ianka-kupala.jpg',
      path: '*локальный путь на проекте - если будет надо*',
    },
    description:
      'Беларускі паэт, драматург, публіцыст, перакладчык, класік беларускай літаратуры',
    birth: {
      date: '25 чэрвеня 1882 года',
      description:
        'Нарадзіўся ў вёсцы Вязынка (цяпер Маладзечанскі раён Мінскай вобласці, Беларусь)',
      location: {
        name: 'г.Маладзечна',
        lat: 54.313611,
        lng: 26.851667,
        zoom: 7,
      },
    },
    death: {
      date: '28 чэрвеня 1942 года',
      description:
        'Пахаваны ў Мінску на Вайсковых могілках, побач з магілай маці',
      location: {
        name: 'г.Мінск',
        lat: 53.9081569,
        lng: 27.5845868,
        zoom: 7,
      },
    },
    biography: [
      {
        date: '1902 год',
        description:
          'Працаваў хатнім настаўнікам, пісарам у абшарніцкім маёнтку, прыказчыкам і на іншых працах',
      },
      {
        date: '1908-1909 гады',
        description: 'Працаваў у рэдакцыі першай беларускай газеты «Наша Ніва»',
      },
      {
        date: '1909-1913 гады',
        description:
          'Вучыўся ў Санкт-Пецярбургу на падрыхтоўчых агульнаадукацыйных курсах А. Чарняева',
      },
      {
        date: '1915 год',
        description:
          'Вучыўся ў Маскоўскім гарадскім народным універсітэце імя А. Л. Шаняўскага',
      },
      {
        date: '1916 год',
        description:
          'Быў прызваны ў войска ў дарожна-будаўнічы атрад, у складзе якога працаваў аж да наступлення падзей Кастрычніцкай рэвалюцыі',
      },
      {
        date: '1925 год',
        description: 'Народны паэт БССР',
      },
      {
        date: '1928 год',
        description: 'Акадэмік Акадэміі навук БССР',
      },
      {
        date: '1929 год',
        description: 'Акадэмік Акадэміі навук УССР',
      },
    ],
    works: [
      {
        date: '1907 год',
        description: 'Паэмы «Узімку», «Нікому», «Калека»',
      },
      {
        date: '1908 год',
        description: 'Зборнік вершаў «Жалейка»',
      },
      {
        date: '1912 год',
        description: "П'еса «Паўлінка»",
      },
      {
        date: '1913 год',
        description: 'Зборнік вершаў «Шляхам жыцця»',
      },
      {
        date: '1922 год',
        description: 'Зборнік вершаў «Спадчына»',
      },
      {
        date: '1922 год',
        description: "П'еса «Тутэйшыя»",
      },
      {
        date: '1925 год',
        description: 'Зборнік вершаў «Безназоўнае»',
      },
      {
        date: '1930 год',
        description: 'Зборнік вершаў «Адцьвітаньне»',
      },
      {
        date: '1936 год',
        description: 'Зборнік вершаў «Песня будаўніцтву»',
      },
      {
        date: '1940 год',
        description: 'Зборнік вершаў «Ад сэрца»',
      },
      {
        date: '1942 год',
        description: 'Зборнік вершаў «Беларускім партызанам»',
      },
    ],
    gallery: [
      {
        link: 'https://a.d-cd.net/ef43feas-960.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://24smi.org/public/media/resize/800x-/celebrity/2018/12/06/a4s1rh4cka2g-ianka-kupala-v-molodosti.jpg',
        path: 'локальный путь...',
      },
      {
        link: 'https://s9.stc.all.kpcdn.net/share/i/12/9933654/inx960x640.jpg',
        path: 'локальный путь...',
      },
      {
        link: 'https://www.stihi.ru/pics/2017/04/08/2792.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://naviny.by/sites/default/files/field/image/kupala-600.jpg',
        path: 'локальный путь...',
      },
    ],
    video: {
      youtubeId: 'aJbr-p5cYuI',
      startTime: 21,
    },
  },
  {
    id: 4,
    name: 'Petrus',
    surname: 'Brovka',
    fullName: 'Пётр Усцінавіч Броўка',
    photo: {
      link:
        'https://www.sb.by/upload/medialibrary/07e/07e2b058e731e2c0dd0181cfd61ddff7.jpg',
      path: '*локальный путь на проекте - если будет надо*',
    },
    description: 'Беларускі грамадскі дзеяч, празаік, паэт і перакладчык',
    birth: {
      date: '12 чэрвеня 1905 года',
      description:
        'Нарадзіўся ў вёсцы Пуцілкавічы (цяпер Ушацкі раён, Віцебская вобласць, Беларусь)',
      location: {
        name: 'в.Пуцілкавічы',
        lat: 54.93778,
        lng: 28.38389,
        zoom: 6,
      },
    },
    death: {
      date: '24 сакавіка 1980 года',
      description: 'Пахаваны ў Мінску на Усходніх могілках',
      location: {
        name: 'г.Мінск',
        lat: 53.89037067092244,
        lng: 27.560757392280152,
        zoom: 6,
      },
    },
    biography: [
      {
        date: '1918—1924 гады',
        description: 'Працаваў перапісчыкам, справаводам і рахаўніком',
      },
      {
        date: '1925—1927 гады',
        description:
          'Быў загадчык аддзелам акруговыя камісіі камсамола ў Полацку',
      },
      {
        date: '1927—1928 гады',
        description:
          'Быў адказным сакратаром рэдакцыі газеты «Чырвоная Полаччына»',
      },
      {
        date: '1928—1931 гады',
        description: 'Вучыўся на педагагічным факультэце БДУ',
      },
      {
        date: '1928 год',
        description:
          "Працаваў у літаратурным аб'яднанні «Маладняк», пазней у Беларускай асацыяцыі пралетарскіх пісьменнікаў (БелАПП)",
      },
      {
        date: '1941—1942 гады',
        description:
          'Служыў у Рабоча-Сялянскай Чырвонай арміі, працаваў у франтавым і партызанскім друку',
      },
      {
        date: '1943—1945 гады',
        description: 'Адказны сакратар саюза пісьменнікаў БССР',
      },
      {
        date: '1945—1948 гады',
        description: 'Галоўны рэдактар літаратурнага часопіса «Полымя»',
      },
      {
        date: '1948—1967 гады',
        description: 'Старшыня Праўлення саюза пісьменнікаў БССР',
      },
      {
        date: '1967—1980 гады',
        description: 'Галоўны рэдактар Беларускай савецкай энцыклапедыі',
      },
    ],
    works: [
      {
        date: '1930 год',
        description: 'Зборнік вершаў «Гады як шторм»',
      },
      {
        date: '1931 год',
        description: 'Аповесць «Каландры»',
      },
      {
        date: '1932 год',
        description: 'Зборнік вершаў «Паэзія»',
      },
      {
        date: '1934 год',
        description: 'Зборнік вершаў «Так пачыналася маладосць»',
      },
      {
        date: '1935 год',
        description: 'Зборнік вершаў «Прыход героя»',
      },
      {
        date: '1937 год',
        description: 'Зборнік вершаў «Вясна радзімы»',
      },
      {
        date: '1940 год',
        description: 'Зборнік вершаў «Вершы і паэмы»',
      },
      {
        date: '1946 год',
        description: 'Зборнік вершаў «У роднай хаце»',
      },
      {
        date: '1950 год',
        description: 'Зборнік вершаў «Сонечнымі днямі»',
      },
      {
        date: '1954 год',
        description: 'Зборнік вершаў «Цвёрдым крокамі»',
      },
      {
        date: '1957 год',
        description: 'Раман «Калі зліваюцца рэкі»',
      },
      {
        date: '1960 год',
        description: 'Зборнік вершаў «Далёка ад дому»',
      },
      {
        date: '1967 год',
        description: 'Паэма «Заўсёды з Леніным»',
      },
      {
        date: '1972 год',
        description: 'Зборнік вершаў «Калі ласка»',
      },
      {
        date: '1974 год',
        description: 'Зборнік апавяданняў «Разам з камісарам»',
      },
      {
        date: '1982 год',
        description: 'Зборнік вершаў «Савецкі чалавек»',
      },
    ],
    gallery: [
      {
        link:
          'https://www.nlb.by/upload/prod/UNESCO/spisok/unesco-10-nlb-dates-Brouka.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://minsk950.belta.by/images/tild3539-3432-4465-b662-643333386235__noroot.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://www.sb.by/upload/iblock/062/06205d4575f30d422bec59a54d993de5.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://places.by/wp-content/uploads/2017/08/Pyatrus-Brouka-600x428.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://places.by/wp-content/uploads/2017/08/Mogila-Petrusya-Brovki.jpg',
        path: 'локальный путь...',
      },
    ],
    video: {
      youtubeId: '7xHGTr4EbK4',
      startTime: 28,
    },
  },
  {
    id: 5,
    name: 'Arkadi',
    surname: 'Kuleshov',
    fullName: 'Аркадзь Аляксандравіч Куляшоў',
    photo: {
      link: 'https://coollib.net/sites/default/files/Arkadiy-Kuleshov.jpg',
      path: '*локальный путь на проекте - если будет надо*',
    },
    description: 'Беларускі савецкі паэт і перакладчык, сцэнарыст',
    birth: {
      date: '24 студзеня 1914 года',
      description:
        'Нарадзіўся ў вёсцы Самотевічі (цяпер Касцюковіцкі раён Магілёўскай вобласці, Беларусь)',
      location: {
        name: 'в.Самотевічі',
        lat: 53.210446,
        lng: 31.830949,
        zoom: 6,
      },
    },
    death: {
      date: '4 лютага 1978 года',
      description: 'Пахаваны ў Мінску на Усходніх могілках',
      location: {
        name: 'г.Мінск',
        lat: 53.89037067092244,
        lng: 27.560757392280152,
        zoom: 6,
      },
    },
    biography: [
      {
        date: '1918—1924 гады',
        description: 'Працаваў перапісчыкам, справаводам і рахаўніком',
      },
      {
        date: '1928 год',
        description:
          'Пасля заканчэння Самотевічскай сямігадовай школы паступіў у Мсціслаўскі педагагічны тэхнікум',
      },
      {
        date: '1930—1933 гады',
        description:
          'Пераехаў у Мінск, дзе працягваў вучобу на літаратурным факультэце Мінскага педагагічнага інстытута',
      },
      {
        date: '1941-1942 гады',
        description:
          'Уступіў у шэрагі Чырвонай Арміі. Пад Ноўгарадам скончыў ваенна-палітычную вучэльню і быў накіраваны ў вайсковую газету «Знамя саветаў»',
      },
      {
        date: '1943-1944 гады',
        description: 'Служыў у Беларускім штабе партызанскага руху',
      },
      {
        date: '1945—1946 гады',
        description:
          'Працаваў галоўным рэдактарам газеты «Літаратура і мастацтва»',
      },
      {
        date: '1946—1958 гады',
        description: 'Начальнік сцэнарнага аддзела',
      },
      {
        date: '1958—1967 гады',
        description: 'Галоўны рэдактар кінастудыі «Беларусьфільм»',
      },
    ],
    works: [
      {
        date: '1931 год',
        description: 'Паэма «Крыўда»',
      },
      {
        date: '1933 год',
        description: 'Паэма «Аманал»',
      },
      {
        date: '1935 год',
        description: 'Паэма «Гарбун»',
      },
      {
        date: '1938 год',
        description: 'Зборнік вершаў «Мы жывем на мяжы»',
      },
      {
        date: '1940 год',
        description: 'Зборнік вершаў «У зялёнай дуброве»',
      },
      {
        date: '1941 год',
        description: 'Паэма «Баранаў Васіль»',
      },
      {
        date: '1943 год',
        description: 'Зборнік вершаў «Сцяг брыгады»',
      },
      {
        date: '1944 год',
        description: 'Паэма «Дом № 24»',
      },
      {
        date: '1945 год',
        description: 'Паэма «Прыгоды цымбал»',
      },
      {
        date: '1946 год',
        description: 'Зборнік вершаў «Вершы»',
      },
      {
        date: '1949 год',
        description: 'Паэма «Простыя людзі»',
      },
      {
        date: '1949 год',
        description: 'Зборнік вершаў «Камуністы»',
      },
      {
        date: '1954 год',
        description: 'Зборнік вершаў «Межы»',
      },
      {
        date: '1972 год',
        description: 'Паэма «Далёка да акіяна»',
      },
      {
        date: '1975 год',
        description: 'Паэма «Хамутиус»',
      },
      {
        date: '1976 год',
        description: 'Зборнік вершаў «Хуткасць»',
      },
    ],
    gallery: [
      {
        link: 'https://forum.vgd.ru/file.php?fid=403275&key=2069824477',
        path: 'локальный путь...',
      },
      {
        link:
          'https://upload.wikimedia.org/wikipedia/commons/f/f8/Stamps_of_Belarus_2014_Arkad%C5%BA_Kulia%C5%A1o%C7%94.jpg',
        path: 'локальный путь...',
      },
      {
        link: 'https://minsknews.by/wp-content/uploads/2019/07/1-44.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://www.places.by/wp-content/uploads/2017/08/kuliaszou135.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://zviazda.by/sites/default/files/field/image/21-17_kopiya_6.jpg',
        path: 'локальный путь...',
      },
    ],
    video: {
      youtubeId: '-htllJNjITg',
      startTime: 1,
    },
  },
  {
    id: 6,
    name: 'Maksim',
    surname: 'Tank',
    fullName: 'Максім Танк',
    photo: {
      link: 'https://gazetaby.com/uploads/2017/09/tank_18-1.jpg',
      path: '*локальный путь на проекте - если будет надо*',
    },
    description: 'Беларускі і савецкі паэт, перакладчык, грамадскі дзеяч',
    birth: {
      date: '4 верасня 1912 года',
      description:
        'Нарадзіўся ў вёске Пількаўшчына (цяпер Мядзельскі раён Мінскай вобласці, Беларусь)',
      location: {
        name: 'г.Мядзел',
        lat: 54.87556,
        lng: 26.93861,
        zoom: 9,
      },
    },
    death: {
      date: '4 лютага 1978 года',
      description: 'Пахаваны ў роднай вёсцы',
      location: {
        name: 'в.Навікі',
        lat: 54.787294,
        lng: 27.096704,
        zoom: 9,
      },
    },
    biography: [
      {
        date: '1914 год',
        description:
          "Сям'я паэта з-за першай сусветнай вайны вымушана эміграваць у Маскву",
      },
      {
        date: '1922 год',
        description:
          "З-за моцнага голаду разам з сям'ёй пакідае Маскву і вяртаецца ў родную вёску, каб самім вырошчваць свой хлеб",
      },
      {
        date: '1923-1926 гады',
        description:
          'Паступіў у пачатковую польскую школу, а затым у рускую прыватную гімназію',
      },
      {
        date: '1928 год',
        description: 'Перавёўся ў беларускую гімназію ў Радашковічах',
      },
      {
        date: '1929 год',
        description:
          'І за ўдзел у страйку, арганізаванай гімназістамі, быў адлічаны. Пасля гэтага нядоўга вучыўся ў Віленскай беларускай гімназіі, але таксама быў адлічаны за вальнадумства і непаслухмянасьць',
      },
      {
        date: '7 красавіка 1932 года',
        description:
          'Публікуе ў газеце «Беларускае жыццё» свой верш «Заштрайкавалі гіганты-коміны» пад псеўданімам Максім Танк',
      },
      {
        date: '27 красавіка 1932 года',
        description:
          'За падпольную камуністычную дзейнасць Танка арыштоўваюць і садзяць у віленскую турму Лукішкі. Праз месяц ён выходзіць на свабоду',
      },
      {
        date: 'Восенню 1932 года',
        description:
          'Пераходзіць савецка-польскую мяжу і накіроўваецца ў Мінск. Тут яго арыштоўваюць і два тыдні трымаюць пад вартай. Вядуць допыты, праводзяць «сяброўскія гутаркі». Пасля гэтага маладога паэта дэпартуюць назад',
      },
      {
        date: '1945-1948 гады',
        description: 'Рэдактар сатырычнага часопіса «Вожык»',
      },
      {
        date: '1948-1966 гады',
        description: 'Галоўны рэдактар літаратурнага часопіса «Полымя»',
      },
      {
        date: '1966-1971 гады',
        description: 'Першы сакратар праўлення ў Саюзе пісьменнікаў БССР',
      },
      {
        date: '1971-1990 гады',
        description: 'Старшыня праўлення ў Саюзе пісьменнікаў БССР',
      },
    ],
    works: [
      {
        date: '1936 год',
        description: 'Зборнік вершаў «На этапах»',
      },
      {
        date: '1937 год',
        description: 'Паэма «Нарач»',
      },
      {
        date: '1938 год',
        description: 'Зборнік вершаў «Пад мачтай»',
      },
      {
        date: '1945 год',
        description: 'Зборнік вершаў «Вастрыце зброю»',
      },
      {
        date: '1948 год',
        description: 'Зборнік вершаў «Каб ведалі»',
      },
      {
        date: '1954 год',
        description: 'Зборнік вершаў «У дарозе»',
      },
      {
        date: '1955 год',
        description: 'Казка «Конь і леў»',
      },
      {
        date: '1957 год',
        description: 'Зборнік вершаў «След бліскавіцы»',
      },
      {
        date: '1963 год',
        description: 'Зборнік вершаў «Лірыка»',
      },
      {
        date: '1970 год',
        description: 'Казка «Светлячок»',
      },
      {
        date: '1972 год',
        description: 'Зборнік вершаў «Ключ жураўліны»',
      },
      {
        date: '1984 год',
        description: 'Зборнік вершаў «За маім сталом»',
      },
      {
        date: '1988 год',
        description: 'Зборнік вершаў «Дарога і хлеб»',
      },
      {
        date: '1990 год',
        description: 'Зборнік вершаў «Паслухайце, вясна ідзе»',
      },
      {
        date: '1994 год',
        description: 'Зборнік вершаў «Мой каўчэг»',
      },
    ],
    gallery: [
      {
        link: 'https://gazetaby.com/uploads/2017/09/tank_18-2.jpg',
        path: 'локальный путь...',
      },
      {
        link: 'https://gazetaby.com/uploads/2017/09/tank_18-7.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://www.sb.by/upload/medialibrary/42d/42d5281c105c7d8664131043599ee11f.jpg',
        path: 'локальный путь...',
      },
      {
        link: 'https://zviazda.by/sites/default/files/field/image/7_38.jpg',
        path: 'локальный путь...',
      },
      {
        link:
          'https://www.belta.by/uploads/lotus/news/000027_25D7C6C9F9FEB3234325819C0026C82D_521788.jpg',
        path: 'локальный путь...',
      },
    ],
    video: {
      youtubeId: '40Uhtifsk7s',
      startTime: 21,
    },
  },
];
